Chatoese/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/* Forward declarations */
static void update_blade_led(void);

/* ---------------------------------------------------------------------------
 * Broadcast backpressure helpers
 * ---------------------------------------------------------------------------*/
static inline bool nbt_due(const nbt_t *nbt, const uint32_t now_tick) {
  return (now_tick - nbt->previousMillis) > nbt->timeout;
}

static inline void nbt_consume(nbt_t *nbt, const uint32_t now_tick) {
  nbt->previousMillis = now_tick;
}

static inline uint32_t usb_cdc_framed_packet_size(const size_t raw_packet_size) {
  /* All current packets are far below 254 bytes, so COBS adds at most one
   * overhead byte. Framed wire size = leading 0x00 + encoded payload + trailing
   * 0x00 <= raw + 3. */
  return (uint32_t)raw_packet_size + 3u;
}

static inline bool usb_cdc_can_queue_bytes(const uint32_t wire_bytes) {
  return CDC_TXQueue_GetWriteAvailable() >= wire_bytes;
}

static inline bool usb_cdc_should_send_telemetry_packet(
    const uint32_t wire_bytes) {
  if (!CDC_ShouldSendTelemetry()) {
    return false;
  }

  if (!usb_cdc_can_queue_bytes(wire_bytes)) {
    WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_TX_QUEUE_FULL);
    return false;
  }

  return true;
}

/* ---------------------------------------------------------------------------
 * COBS packet handlers (Host -> Firmware)
 * ---------------------------------------------------------------------------*/

static void on_heartbeat(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_heartbeat_t) - 2u) {
    return;
  }

  const pkt_heartbeat_t *pkt = reinterpret_cast<const pkt_heartbeat_t *>(data);

  last_heartbeat_tick = HAL_GetTick();

  /* Latch fully cleared elsewhere (e.g. play button in EmergencyController)
   * while the watchdog flag was still set — drop the stale flag so a LATER
   * unrelated latch is not mis-attributed as comms-loss on the wire. */
  if (!Emergency_State()) {
    comms_latch = false;
  }

  /* Comms restored. If the outstanding latch is still PURE comms-loss —
   * i.e. no debounced sensor bit has latched into Emergency_State() and no
   * physical sensor is asserted right now — auto-clear it so a brief
   * host/USB stall doesn't strand the robot until a manual reset. The
   * "pure comms" decision reads the DEBOUNCED state bits, so a transient
   * sensor blip during the outage neither blocks the auto-clear nor
   * (as before 2026-08-09) permanently disarms it; a trigger that made it
   * through EmergencyController's debounce sets a sensor bit above 0b1 and
   * correctly demands an explicit operator release. */
  if (comms_latch && Emergency_State()) {
    const bool sensor_bit_latched = (Emergency_State() & ~1u) != 0u;
    if (!sensor_bit_latched && !any_physical_emergency()) {
      Emergency_SetState(0);
      comms_latch = false;
      debug_printf("heartbeat resumed: comms-loss emergency auto-cleared\r\n");
    } else if (sensor_bit_latched) {
      /* A debounced physical trigger latched during the outage — this is no
       * longer a pure comms latch; require an explicit operator release. */
      comms_latch = false;
    }
  }

  if (pkt->emergency_requested) {
    comms_latch = false;  /* host-commanded e-stop is not comms-loss */
    Emergency_SetState(1);
  }
  if (pkt->emergency_release_requested) {
    /* Only clear emergency if no physical sensor is still asserted.
     * Firmware is the sole safety authority — never bypass hardware. */
    if (!any_physical_emergency()) {
      Emergency_SetState(0);
      comms_latch = false;
    } else {
      debug_printf(
          "emergency release rejected: physical sensor still active\r\n");
    }
  }
}

static void on_cmd_vel(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_vel_t) - 2u) {
    return;
  }

  const pkt_cmd_vel_t *pkt = reinterpret_cast<const pkt_cmd_vel_t *>(data);

  const float vx = pkt->linear_x;
  const float wz = pkt->angular_z;

  /* Firmware is the final safety authority.  Validate before refreshing the
   * watchdog: NaN defeats ordinary >/< clamps, and an invalid packet must
   * never preserve or refresh a motion target.  Clear all command state so a
   * malformed packet deterministically stops the next motor cycle. */
  mowgli_cmd_vel::SafetyState safety_state{
      cmd_wz, left_target_mps, right_target_mps, last_cmd_vel_tick};
  if (!mowgli_cmd_vel::apply_safety(vx, wz, HAL_GetTick(), safety_state)) {
    cmd_wz = safety_state.cmd_wz;
    left_target_mps = safety_state.left_target_mps;
    right_target_mps = safety_state.right_target_mps;
    return;
  }

  /* Only a validated command is a new cmd_vel heartbeat. */
  last_cmd_vel_tick = safety_state.last_valid_tick;

  if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
    return;
  }

  /* Commanded yaw rate for the firmware yaw-rate loop (Option C), read in the
   * motor timebase by motors_handler. Stored raw (pre-IK) so the loop tracks
   * the operator/Nav2 intent, not the clamped per-wheel reconstruction. */
  cmd_wz = wz;

  /* Differential-drive inverse kinematics — per-wheel linear speed. Wheel base
   * and the ±cap are runtime values (PKT_ID_SET_KINEMATICS); the compile-time
   * WHEEL_BASE/MAX_MPS remain the power-on fallback. The cap can only be lowered
   * below the compiled MAX_MPS ceiling (DRIVEMOTOR_GetMaxMps clamps it). */
  const float wheel_base = g_wheel_base;
  const float max_mps = DRIVEMOTOR_GetMaxMps();
  float left_mps = vx - wz * wheel_base * 0.5f;
  float right_mps = vx + wz * wheel_base * 0.5f;

  if (left_mps > max_mps)
    left_mps = max_mps;
  if (left_mps < -max_mps)
    left_mps = -max_mps;
  if (right_mps > max_mps)
    right_mps = max_mps;
  if (right_mps < -max_mps)
    right_mps = -max_mps;

  /* Hand the target wheel velocities to the PI loop in motors_handler.
   * The mapping to PWM (feedforward + closed-loop correction) lives
   * there now so the integrator can bridge the static-friction
   * deadband on sub-deadband commands. */
  left_target_mps = left_mps;
  right_target_mps = right_mps;
}

static void on_set_drive_pid(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_drive_pid_t) - 2u) {
    return;
  }

