Chatoese/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
  const pkt_set_drive_pid_t *pkt =
      reinterpret_cast<const pkt_set_drive_pid_t *>(data);

  /* Drive behaviour is safety-relevant: reject the whole packet if any field
   * is non-finite, then clamp each field to a safe range before applying so a
   * bad host value can never make the wheel loop diverge. Both wheels share
   * the gains; the output limit stays fixed at 255 PWM (motor controller max).
   * pid_constrain() comes from pid.hpp. */
  if (!std::isfinite(pkt->ticks_per_meter) || !std::isfinite(pkt->kp) ||
      !std::isfinite(pkt->ki) || !std::isfinite(pkt->kd) ||
      !std::isfinite(pkt->integral_limit) || !std::isfinite(pkt->pwm_per_mps)) {
    debug_printf("set_drive_pid rejected: non-finite field\r\n");
    return;
  }

  const float ticks_per_meter =
      pid_constrain(pkt->ticks_per_meter, 50.0f, 5000.0f);
  const float kp = pid_constrain(pkt->kp, 0.0f, 200.0f);
  const float ki = pid_constrain(pkt->ki, 0.0f, 20000.0f);
  const float kd = pid_constrain(pkt->kd, 0.0f, 500.0f);
  const float ilim = pid_constrain(pkt->integral_limit, 0.0f, 255.0f);
  const float ff = pid_constrain(pkt->pwm_per_mps, 50.0f, 600.0f);

  /* Apply atomically w.r.t. motors_handler(), which reads these objects in the
   * main loop at 50 Hz: this handler runs in USB RX interrupt context, and a
   * half-applied update (e.g. new gains but the old integral limit) could let
   * the ki integrator wind up unbounded for one cycle. Same __disable_irq
   * guard motors_handler uses for its setpoint snapshot. setOutputLimit is
   * re-asserted here so the ±255 clamp never silently depends on init_ROS
   * having run first (the PX4 PID default-inits _limit_output to 0). */
  __disable_irq();
  left_wheel_pid.setGains(kp, ki, kd);
  left_wheel_pid.setIntegralLimit(ilim);
  left_wheel_pid.setOutputLimit(255.0f);
  right_wheel_pid.setGains(kp, ki, kd);
  right_wheel_pid.setIntegralLimit(ilim);
  right_wheel_pid.setOutputLimit(255.0f);
  DRIVEMOTOR_SetTicksPerMeter(ticks_per_meter);
  g_pwm_per_mps = ff;
  __enable_irq();

  /* Do not log successful drive-PID updates here: this handler runs in the USB
   * RX path and hardware_bridge intentionally re-sends the packet in bursts
   * after reconnect. Printing each success over the debug UART can stall long
   * enough to starve the main loop and re-trigger the watchdog reboot loop. */
}

static void on_set_yaw_pid(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_yaw_pid_t) - 2u) {
    return;
  }

  const pkt_set_yaw_pid_t *pkt =
      reinterpret_cast<const pkt_set_yaw_pid_t *>(data);

  /* Yaw regulation is safety-relevant (it steers the chassis): reject the whole
   * packet if any gain/limit is non-finite, then clamp before applying so a bad
   * host value can never make the yaw loop diverge. */
  if (!std::isfinite(pkt->yaw_kp) || !std::isfinite(pkt->yaw_ki) ||
      !std::isfinite(pkt->trim_limit_mps) ||
      !std::isfinite(pkt->gyro_bias_radps)) {
    debug_printf("set_yaw_pid rejected: non-finite field\r\n");
    return;
  }

  const float kp = pid_constrain(pkt->yaw_kp, 0.0f, 5.0f);
  const float ki = pid_constrain(pkt->yaw_ki, 0.0f, 20.0f);
  const float tl =
      pid_constrain(pkt->trim_limit_mps, 0.0f, DRIVEMOTOR_GetMaxMps());
  const uint8_t en = (pkt->enabled != 0) ? 1u : 0u;
  const float sign = (pkt->gyro_sign < 0) ? -1.0f : 1.0f;
  /* A physical at-rest gyro bias is small (WT901: a few deg/s). Clamp hard so a
   * bad host value can only nudge, not steer — and the differential trim clamp
   * below bounds the yaw correction regardless. */
  const float bias = pid_constrain(pkt->gyro_bias_radps, -0.5f, 0.5f);

  /* Apply atomically w.r.t. motors_handler() (reads these at 50 Hz); this
   * handler runs in USB RX interrupt context. The integral limit is pinned to
   * the trim limit so the integrator alone can never exceed the differential
   * clamp. Same __disable_irq guard as on_set_drive_pid. */
  __disable_irq();
  yaw_pid.setGains(kp, ki, 0.0f);
  yaw_pid.setIntegralLimit(tl * YAW_INT_LIMIT_FRAC);
  yaw_pid.setOutputLimit(tl);
  g_yaw_trim_limit_mps = tl;
  g_yaw_gyro_sign = sign;
  g_yaw_gyro_bias = bias;
  g_yaw_loop_enabled = en;
  __enable_irq();
}

static void on_set_kinematics(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_kinematics_t) - 2u) {
    return;
  }

  const pkt_set_kinematics_t *pkt =
      reinterpret_cast<const pkt_set_kinematics_t *>(data);

  /* Motion caps are safety-relevant: reject the whole packet if any field is
   * non-finite, then clamp before applying. max_mps is clamped by
   * DRIVEMOTOR_SetMaxMps to (0, compile-time MAX_MPS] — the wire can only LOWER
   * the cap, never raise it above the compiled ceiling. wheel_base is clamped to
   * a sane physical range. Applied atomically w.r.t. motors_handler() (50 Hz);
   * this handler runs in USB RX interrupt context. */
  if (!std::isfinite(pkt->max_mps) || !std::isfinite(pkt->wheel_base)) {
    debug_printf("set_kinematics rejected: non-finite field\r\n");
    return;
  }

  const float wb = pid_constrain(pkt->wheel_base, 0.15f, 0.60f);

  __disable_irq();
  DRIVEMOTOR_SetMaxMps(pkt->max_mps); /* clamps to (0, MAX_MPS] internally */
  g_wheel_base = wb;
  __enable_irq();
}

static void on_set_safety_limits(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_set_safety_limits_t) - 2u) {
    return;
  }

  const pkt_set_safety_limits_t *pkt =
      reinterpret_cast<const pkt_set_safety_limits_t *>(data);

  /* Charge/e-stop limits are safety-critical: reject the whole packet if a charge
   * field is non-finite. charger.c / emergency.c then clamp EVERY field so the
   * wire can only make protection STRONGER (lower charge ceiling, faster trips,
   * harder emergency-clear), never weaker; the compile-time board_defaults values
   * remain the power-on fallback (an unconnected host = full vetted safety).
   * emergency_set_timeouts self-guards its group apply; the two charge stores are
   * individually atomic (single 32-bit writes on Cortex-M3). */
  if (!std::isfinite(pkt->max_charge_voltage) ||
      !std::isfinite(pkt->max_charge_current)) {
    debug_printf("set_safety_limits rejected: non-finite charge field\r\n");
    return;
  }

  charger_set_charge_limits(pkt->max_charge_voltage, pkt->max_charge_current);
  emergency_set_timeouts(pkt->one_wheel_lift_ms, pkt->both_wheels_lift_ms,
                         pkt->tilt_ms, pkt->stop_button_ms, pkt->play_clear_ms);
}

static void on_hl_state(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_hl_state_t) - 2u) {
    return;
  }

  const pkt_hl_state_t *pkt = reinterpret_cast<const pkt_hl_state_t *>(data);

  hl_current_mode = pkt->current_mode;
  hl_gps_quality = pkt->gps_quality;

  // Update panel LEDs based on mode
  if (hl_gps_quality < 90) {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
  } else {
    PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
  }

  // Map host mode to internal status for motor safety.
  // Constants defined in mowgli_protocol.h — keep in sync with
  // HighLevelStatus.msg.
  switch (hl_current_mode) {
  case HL_MODE_AUTONOMOUS:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_RECORDING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
    break;
  case HL_MODE_MANUAL_MOWING:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
    main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
    break;
  case HL_MODE_NULL:
  case HL_MODE_IDLE:
  default:
    PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
    PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
    main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
    left_target_mps = right_target_mps = 0.0f;
    cmd_wz = 0.0f;
    blade_on_off = target_blade_on_off = 0;
    break;
  }

  update_blade_led();
}

