Chatoese/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
static void on_cmd_blade(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_cmd_blade_t) - 2u) {
    return;
  }

  const pkt_cmd_blade_t *pkt = reinterpret_cast<const pkt_cmd_blade_t *>(data);
  /* Defense-in-depth: never arm the blade target while IDLE/docked. The
   * authoritative gate is in motors_handler (which zeroes blade_on_off in
   * IDLE every tick), but refusing to latch the target here keeps state
   * consistent and avoids an instantaneous spin-up on the IDLE→MOWING edge.
   * blade_dir is still accepted so direction is correct once mowing starts. */
  if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
    target_blade_on_off = 0;
  } else {
    target_blade_on_off = pkt->blade_on;
  }
  blade_direction = pkt->blade_dir;
}

/* Host -> Firmware reboot request. Sets reboot_flag so chatter_handler issues
 * NVIC_SystemReset on its next tick (lets the current packet/ISR unwind first).
 * Gated on the magic byte so a corrupt/misframed packet can't reset the board.
 */
static void on_reboot(const uint8_t *data, size_t len) {
  if (len < sizeof(pkt_reboot_t) - 2u) {
    return;
  }
  const pkt_reboot_t *pkt = reinterpret_cast<const pkt_reboot_t *>(data);
  if (pkt->magic == PKT_REBOOT_MAGIC) {
    debug_printf("reboot requested by host\r\n");
    reboot_flag = true;
  }
}

/* Host -> Firmware config/version request. Replies with this firmware's
 * wire-protocol version (the compatibility key the host checks) and its
 * human-readable semver, so the ROS 2 image can confirm it is talking to a
 * compatible firmware and warn the operator to reflash on mismatch. Firmware
 * older than this handshake never registers this handler, so it simply never
 * replies — which the host reads as "incompatible firmware". */
static void on_config_req(const uint8_t *data, size_t len) {
  if (len < 1u) {
    return;
  }
  const uint8_t flags = (len >= 2u) ? data[1] : 0u;
  g_firmware_debug_enabled = (flags & CONFIG_FLAG_FIRMWARE_DEBUG) != 0u ? 1u : 0u;

  pkt_config_rsp_t rsp;
  rsp.type = PKT_ID_CONFIG_RSP;
  rsp.protocol_version = MOWGLI_PROTOCOL_VERSION;
  rsp.active_flags = g_firmware_debug_enabled != 0u ? CONFIG_FLAG_FIRMWARE_DEBUG : 0u;
  rsp.fw_version_major = MOWGLI_FW_VERSION_MAJOR;
  rsp.fw_version_minor = MOWGLI_FW_VERSION_MINOR;
  rsp.fw_version_patch = MOWGLI_FW_VERSION_PATCH;
  mowgli_comms_send(&rsp, sizeof(rsp));
}

/* on_hl_state blade LED feedback (moved out of on_hl_state for clarity) */
static void update_blade_led(void) {
  if (target_blade_on_off) {
#ifdef PANEL_LED_2H
    if (BLADEMOTOR_bActivated) {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
    } else {
      PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
    }
#endif
  } else {
#ifdef PANEL_LED_2H
    PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
#endif
  }
}

/* ---------------------------------------------------------------------------
 * USB CDC receive callback — feeds COBS layer
 * ---------------------------------------------------------------------------*/
uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len) {
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_PROCESS);
  mowgli_comms_process_rx(Buf, (size_t)len);
  WATCHDOG_SetMainLoopStage(WATCHDOG_STAGE_CDC_RX_EXIT);
  return CDC_RX_DATA_HANDLED;
}

/* ---------------------------------------------------------------------------
 * usb_cdc_transmit — required by mowgli_comms.c
 * ---------------------------------------------------------------------------*/
void usb_cdc_transmit(const uint8_t *buf, size_t len) {
  CDC_Transmit(buf, (uint32_t)len);
}

/* ---------------------------------------------------------------------------
 * LED blink + reboot handler (replaces chatter_handler)
 * ---------------------------------------------------------------------------*/
extern "C" void chatter_handler() {
  if (NBT_handler(&led_nbt)) {
    HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);

    if (reboot_flag) {
      NVIC_SystemReset();
    }
  }
}

/* Anti-dig per-wheel step (task #46). Returns true when the wheel must be cut
 * (caller forces PWM 0 + resets that wheel's integrator). Over each window it
 * accumulates BOTH the actual travel (|dticks|) AND the travel the commanded
 * speed implies (|target| × ticks_per_meter × dt); at window end it latches iff
 * the wheel kept less than PROGRESS_FRACTION of that commanded travel while
 * pushing. Comparing to the *command* (not a fixed distance) means a wheel that
 * keeps up with its setpoint — fast or slow, light or heavy load — is never
 * flagged, while a wheel PLOWING at a small fraction of its command latches
 * even if its absolute creep is non-trivial (the loophole in the old fixed-
 * 0.03 m floor, which reset forever on any creep above it). Clears the latch
 * the instant the command drops below MIN_TARGET.
 *
 * MANUAL FIELD TEST (supervised, 2026-07-21 — no host test harness for this
 * TU): 1) On turf, command a straight drive into a fixed obstacle (wall/post)
 * so both wheels stall while cmd_vel keeps requesting ~0.15 m/s. Expect BOTH
 * wheels to cut within ~WINDOW_MS (~1.5 s) — verify no continued grinding.
 * 2) Back off; confirm the latch clears (wheels drive again) once cmd_vel
 * returns to ~0. 3) Regression: a full normal mow + a slow dock approach must
 * NOT trip the latch (heavy grass load and slope climbing keep >30% of the
 * commanded travel). 4) Half-block ONE wheel (e.g. against a low kerb) and
 * confirm only that wheel latches. */
static bool antidig_step(uint32_t *stall_ms, int32_t *stall_ticks,
                         float *exp_ticks, bool *latched, float target,
                         int16_t pwm, int32_t dticks, float ticks_per_meter) {
  const bool commanded = fabsf(target) > ANTIDIG_MIN_TARGET_MPS;
  if (!commanded) {
    *stall_ms = 0u;
    *stall_ticks = 0;
    *exp_ticks = 0.0f;
    *latched = false;
    return false;
  }
  if (*latched) {
    return true; /* hold until the command clears (handled above) */
  }
  const bool pushing = (pwm > ANTIDIG_MIN_ABS_PWM) || (pwm < -ANTIDIG_MIN_ABS_PWM);
  if (!pushing) {
    *stall_ms = 0u;
    *stall_ticks = 0;
    *exp_ticks = 0.0f;
    return false;
  }
  *stall_ms += MOTORS_NBT_TIME_MS;
  *stall_ticks += (dticks < 0) ? -dticks : dticks;
  *exp_ticks += fabsf(target) * ticks_per_meter * WHEEL_PI_DT_S;
  if (*stall_ms >= ANTIDIG_WINDOW_MS) {
    if ((float)(*stall_ticks) < ANTIDIG_PROGRESS_FRACTION * (*exp_ticks)) {
      *latched = true; /* pushed the whole window, kept <30% of commanded travel → dig */
    } else {
      *stall_ms = 0u; /* keeping up with the command — reset the window */
      *stall_ticks = 0;
      *exp_ticks = 0.0f;
    }
  }
  return *latched;
}

/* ---------------------------------------------------------------------------
 * Drive & blade motors handler
 * ---------------------------------------------------------------------------*/
extern "C" void motors_handler() {
  if (NBT_handler(&motors_nbt)) {
    /* Snapshot ISR-written variables under interrupt lock */
    __disable_irq();
    float snap_left_target = left_target_mps;
    float snap_right_target = right_target_mps;
    float snap_cmd_wz = cmd_wz;
    uint8_t snap_target_blade = target_blade_on_off;
    uint32_t snap_heartbeat = last_heartbeat_tick;
    uint32_t snap_cmd_vel = last_cmd_vel_tick;
    float snap_ticks_per_meter = DRIVEMOTOR_GetTicksPerMeter();
    __enable_irq();

    blade_on_off = snap_target_blade;

    /* --- decide effective target ---
     * Emergency or cmd_vel watchdog timeout overrides to a hard stop.
     * Otherwise the snapshot value drives the PI loop below. */
    bool hard_stop = false;
    if (Emergency_State()) {
      hard_stop = true;
      blade_on_off = 0;
    } else if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE) {
      /* Re-assert the IDLE gate HERE — in the one place that actually
       * drives the wheels AND the blade — so the "never move / never
       * spin the blade while idle/docked" guarantee holds regardless of
       * the relative arrival order of CMD_PWM, CMD_BLADE and HL_STATE.
       * on_hl_state zeroes the targets when the IDLE packet arrives, but
       * a CMD_BLADE(on=1) arriving AFTER it would otherwise re-arm the
       * blade with no gate (on_cmd_blade is fire-and-forget). Firmware is
       * the sole blade safety authority. */
      hard_stop = true;
      blade_on_off = 0;
    } else {
      const uint32_t cmd_vel_age_ms = HAL_GetTick() - snap_cmd_vel;
      if (cmd_vel_age_ms > 200u) {
        /* Command-vel watchdog: zero motors if the host hasn't
         * sent a twist in 200 ms (Pi hang, USB glitch, etc). */
        hard_stop = true;
      }
      if (cmd_vel_age_ms > 25000u) {
        blade_on_off = 0;
      }
    }

